docs/posts/2025-08-17-franciscan-blessing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Aug 17, 2025 19:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Franciscan Blessing</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">A Franciscan Blessing
<br />
<span class="subtitle">Aug 17, 2025 19:36</span>
</h1>
<p>
This is often called &ldquo;A Franciscan Blessing.&rdquo;
</p>

<blockquote>
<p>
May God bless you with discomfort,<br />
at easy answers, half-truths,<br />
and superficial relationships<br />
so that you may live<br />
deep within your heart.
</p>

<p>
May God bless you with anger<br />
at injustice, oppression,<br />
and exploitation of people,<br />
so that you may work for<br />
justice, freedom and peace.
</p>

<p>
May God bless you with tears,<br />
to shed for those who suffer pain,<br />
rejection, hunger, and war,<br />
so that you may reach out your hand<br />
to comfort them and<br />
to turn their pain to joy.
</p>

<p>
And may God bless you<br />
with enough foolishness<br />
to believe that you can<br />
make a difference in the world,<br />
so that you can do<br />
what others claim cannot be done,<br />
to bring justice and kindness<br />
to all our children and the poor.
</p>

<p>
Amen
</p>
</blockquote>

<p>
<a href="https://www.thesacredbraid.com/2016/07/22/a-non-traditional-blessing/">Dan Miller</a> traced it to Sister Ruth Fox, OSB, who was kind of enough to share with him her original version:
</p>

<blockquote>
<p>
<b>A Non-traditional Blessing</b>
</p>

<p>
May God bless you with discontent with easy answers, half-truths, superficial relationships, so that you will live from deep within your heart.
</p>

<p>
May God bless you with anger at injustice, oppression, abuse, and exploitation of people, so that you will work for justice, equality, and  peace.
</p>

<p>
May God bless you with tears to shed for those who suffer from pain, rejection, starvation and war, so that you will reach out your hand to comfort  them and to change their pain to joy.
</p>

<p>
May God bless you with the foolishness to think you can make a difference in this world, so that you will do the things which others tell you cannot be done.
</p>

<p>
If you have the courage to accept these blessings, then God will also bless you with:
</p>

<p>
happiness—because you will know that you have made life better for others
</p>

<p>
inner peace—because you will have worked to secure an outer peace for others
</p>

<p>
laughter—because your heart will be light
</p>

<p>
faithful friends—because they will recognize your worth as a person.
</p>

<p>
These blessings are yours—not for the asking, but for the giving—from One who wants to be your companion, our God, who lives and reigns, forever and ever. Amen.
</p>
</blockquote>

<p class="source">
Sister Ruth Fox, OSB
</p>

<div class="tagline" id="org4079cdc">
<p>
Tagged:  <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Aug 17, 2025 19:57.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
